uhnp/src/Documents/РасчетФинансовогоРезультата/РасчетФинансовогоРезультата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетФинансовогоРезультата</name>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/Documents/УчетнаяПолитикаМСФО/УчетнаяПолитикаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетнаяПолитикаМСФО</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВалютаИсточник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовУчета</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаИсточникДоп</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчетаДоп</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимТрансформационнойКорректировки</name>
    <type>
      <types>EnumRef.РежимКорректировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТрансляции</name>
    <type>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогСущественностиВНА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПризнанияАренды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособТрансляции</name>
    <type>
      <types>EnumRef.СпособыТрансляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДляЧистойЦеныПродажиЗапасов</name>
    <type>
      <types>DefinedType.ТипЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОтложенногоНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПриИзмененииВЗакрытомПериоде</name>
    <type>
      <types>EnumRef.ДействияПриИзмененииВЗакрытомПериодеМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦен</name>
    <type>
      <types>CatalogRef.ВидыКотировокФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БезКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетОтНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗакрытияСчетов</name>
    <type>
      <types>CatalogRef.ВариантыЗакрытияСчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ФиксированныйСчет</name>
      <type>
        <types>CatalogRef.ФиксированныеСчетаУчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/СчетаБД/СчетаБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетаБД</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ПланыСчетовБД</owners>
  <attributes>
    <name>Забалансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетСсылка</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРаздел</name>
    <type>
      <types>EnumRef.РазделПланаСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_АктивОбязательство</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКурсовыхРазниц</name>
    <type>
      <types>EnumRef.СпособыРасчетаКурсовыхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппирующийСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтложенногоНалога</name>
    <type>
      <types>CatalogRef.ВидыВременныхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляИсключенийПриТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежныйИнструмент</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьВидыДвижений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПланаСчетов</name>
    <type>
      <types>CatalogRef.РазделыПланаСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетаУчетаКурсовыхРазниц</name>
    <type>
      <types>CatalogRef.СчетаУчетаКурсовыхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетВФВ</name>
    <type>
      <types>EnumRef.ПересчетыВФВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетВВО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияКорреспонденцииСчета</name>
    <type>
      <types>EnumRef.СпособыДетализацииКорреспонденцииСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыСубконто</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоОбороты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоСальдо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакиУчетаСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконтоСсылка</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ФиксированныеСчетаУчетаБД/ФиксированныеСчетаУчетаБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФиксированныеСчетаУчетаБД</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнеоборотныеАктивы</name>
      <description>Внеоборотные активы</description>
    </items>
    <items>
      <name>КонсолидационныеПоправки</name>
      <description>Консолидационные поправки</description>
    </items>
    <items>
      <name>НераспределеннаяПрибыль</name>
      <description>Нераспределенная прибыль</description>
    </items>
    <items>
      <name>ОбщиеВспомогательныеСчета</name>
      <description>Общие вспомогательные счета</description>
    </items>
    <items>
      <name>ОтложенныеНалоги</name>
      <description>Отложенные налоги</description>
    </items>
    <items>
      <name>РезервыПоПретензиям</name>
      <description>Резервы по претензиям</description>
    </items>
    <items>
      <name>РеформацияБаланса</name>
      <description>Реформация баланса</description>
    </items>
    <items>
      <name>РеформацияСебестоимости</name>
      <description>Реформация себестоимости</description>
    </items>
  </predefined>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Documents/РасчетФинансовогоРезультата/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	Реквизиты = МСФОУХ.РеквизитыДокумента(Запрос, "ПериодОтчета, ДатаНачала, ДатаОкончания, ВидОтчета", "ПериодОтчета", Отказ);
	Реквизиты.Вставить("РеквизитыОшибки",				Новый Структура("ВидОперации", НСтр("ru = 'Вид операции'")));
	Реквизиты.Вставить("ЕстьСуммаВВалютеОтчетности",	Истина);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("Реквизиты", Реквизиты);
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;
	
	Если Реквизиты.ФормироватьПроводкиМСФО Тогда
		МСФОУХ.УдалитьДвиженияДокумента(Реквизиты.Ссылка, Отказ);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ГраницаДоДокумента",		МСФОВызовСервераУХ.ПолучитьГраницуДоДокумента(Реквизиты.Период, Реквизиты.Ссылка));
	Запрос.УстановитьПараметр("Организация",			Реквизиты.Организация);
	Запрос.УстановитьПараметр("Сценарий",				Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("ПериодОтчета", 			Реквизиты.ПериодОтчета);
	Запрос.УстановитьПараметр("НачалоПериода", 			Реквизиты.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 			КонецДня(Реквизиты.ДатаОкончания));
	Запрос.УстановитьПараметр("ПланСчетовМСФО", 		Реквизиты.ПланСчетовМСФО);
	Запрос.УстановитьПараметр("ВидОтчета", 				Реквизиты.ВидОтчета);
	Запрос.УстановитьПараметр("ФункциональнаяВалюта",	Реквизиты.ФункциональнаяВалюта);
	
	НомераТаблиц = Новый Структура;
	ТекстЗапроса = Новый Массив;
	
	ТекстЗапроса.Добавить(ТекстЗапроса_СчетаУчета(НомераТаблиц, Реквизиты.ФормироватьПроводкиМСФО));
	Если Реквизиты.ФормироватьПроводкиМСФО Тогда
		ТекстЗапроса.Добавить(ТекстЗапроса_ОстаткиТУ(НомераТаблиц));
	Иначе	
		ТекстЗапроса.Добавить(МСФОВызовСервераУХ.ТекстЗапроса_АОСВ(НомераТаблиц, "ДО,КО", Истина, "втСчетаУчета"));
	КонецЕсли;
	ТекстЗапроса.Добавить(ТекстЗапроса_ТаблицаПроводок(НомераТаблиц, Реквизиты.ФормироватьПроводкиМСФО));
	
	Запрос.Текст = СтрСоединить(ТекстЗапроса, ОбщегоНазначенияУХВызовСервера.ТекстРазделителяЗапросовПакета());
	ПроведениеСерверУХ.ДополнитьТаблицамиИзПакетаЗапросов(ДополнительныеСвойства.ТаблицыДляДвижений, Запрос, НомераТаблиц);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса_СчетаУчета(НомераТаблиц, ФормироватьПроводкиМСФО = Истина)

	НомераТаблиц.Вставить("втСчетаУчета", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СчетаБД.СчетСсылка КАК Счет
	|ПОМЕСТИТЬ втСчетаУчета
	|ИЗ
	|	Справочник.СчетаБД КАК СчетаБД
	|ГДЕ
	|	СчетаБД.Владелец = &ПланСчетовМСФО
	|	И СчетаБД.РазделПланаСчетов В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.Выручка), ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.Себестоимость), ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.КоммерческиеАдминистративныеРасходы), ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.ВнереализационныеДоходыИРасходы))
	|	И НЕ СчетаБД.ГруппирующийСчет";
	
	Возврат ?(ФормироватьПроводкиМСФО, ТекстЗапроса, СтрЗаменить(ТекстЗапроса, "СчетСсылка", "Ссылка"));

КонецФункции

Функция ТекстЗапроса_ОстаткиТУ(НомераТаблиц)
	
	НомераТаблиц.Вставить("втИтогиПоСчетам", НомераТаблиц.Количество());
		
	Возврат 
	"ВЫБРАТЬ
	|	МСФООбороты.СуммаВВалютеУчетаОборот КАК Сумма,
	|	МСФООбороты.СуммаВВалютеОтчетностиОборот КАК СуммаВВалютеОтчетности,
	|	МСФООбороты.Счет КАК Счет,
	|	МСФООбороты.Субконто1 КАК Субконто1,
	|	МСФООбороты.Субконто2 КАК Субконто2,
	|	МСФООбороты.Субконто3 КАК Субконто3,
	|	МСФООбороты.Подразделение КАК Подразделение,
	|	МСФООбороты.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ втИтогиПоСчетам
	|ИЗ
	|	РегистрБухгалтерии.МСФО.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В
	|				(ВЫБРАТЬ
	|					т.Счет
	|				ИЗ
	|					втСчетаУчета КАК т),
	|			,
	|			Сценарий = &Сценарий
	|				И Организация = &Организация,
	|			,
	|			) КАК МСФООбороты";

КонецФункции

Функция ТекстЗапроса_ТаблицаПроводок(НомераТаблиц, ФормироватьПроводкиМСФО = Истина)
	
	НомераТаблиц.Вставить("ТаблицаПроводок", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА АналитикаКоррСчет.Счет.СчетСсылка
	|		ИНАЧЕ втИтогиПоСчетам.Счет
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА АналитикаКоррСчет.Субконто1
	|		ИНАЧЕ втИтогиПоСчетам.Субконто1
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА АналитикаКоррСчет.Субконто2
	|		ИНАЧЕ втИтогиПоСчетам.Субконто2
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА АналитикаКоррСчет.Субконто3
	|		ИНАЧЕ втИтогиПоСчетам.Субконто3
	|	КОНЕЦ КАК СубконтоДт3,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА NULL
	|		ИНАЧЕ втИтогиПоСчетам.Подразделение
	|	КОНЕЦ КАК ПодразделениеДт,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА NULL
	|		ИНАЧЕ втИтогиПоСчетам.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельностиДт,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.Счет
	|		ИНАЧЕ АналитикаКоррСчет.Счет.СчетСсылка
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.Субконто1
	|		ИНАЧЕ АналитикаКоррСчет.Субконто1
	|	КОНЕЦ КАК СубконтоКт1,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.Субконто2
	|		ИНАЧЕ АналитикаКоррСчет.Субконто2
	|	КОНЕЦ КАК СубконтоКт2,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.Субконто3
	|		ИНАЧЕ АналитикаКоррСчет.Субконто3
	|	КОНЕЦ КАК СубконтоКт3,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.Подразделение
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.НаправлениеДеятельности
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК НаправлениеДеятельностиКт,
	|	ЗНАЧЕНИЕ(Справочник.ВидыОпераций._05РасчетФинансовогоРезультата) КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.СуммаВВалютеОтчетности
	|		ИНАЧЕ -втИтогиПоСчетам.СуммаВВалютеОтчетности
	|	КОНЕЦ КАК СуммаВВалютеОтчетности,
	|	ВЫБОР
	|		КОГДА втИтогиПоСчетам.Сумма > 0
	|			ТОГДА втИтогиПоСчетам.Сумма
	|		ИНАЧЕ -втИтогиПоСчетам.Сумма
	|	КОНЕЦ КАК СуммаВФункциональнойВалюте
	|ИЗ
	|	втИтогиПоСчетам КАК втИтогиПоСчетам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФиксированныеСчетаУчетаБД КАК АналитикаКоррСчет
	|		ПО (АналитикаКоррСчет.Ссылка = ЗНАЧЕНИЕ(Справочник.ФиксированныеСчетаУчетаБД.ТекущийФинансовыйРезультат))
	|ГДЕ
	|	(втИтогиПоСчетам.Сумма <> 0
	|			ИЛИ втИтогиПоСчетам.СуммаВВалютеОтчетности <> 0)";
	
	Документы.УчетнаяПолитикаМСФО.ЗаменитьФиксированныеСчетаУчетаБД(ТекстЗапроса);
	
	Если ФормироватьПроводкиМСФО Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "втИтогиПоСчетам.СуммаВВалютеОтчетности", "0");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "втИтогиПоСчетам.Подразделение", "NULL");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "втИтогиПоСчетам.НаправлениеДеятельности", "NULL");
	
	Возврат СтрЗаменить(ТекстЗапроса, ".СчетСсылка", "");
	
КонецФункции

#КонецОбласти

#КонецЕсли
